# ============================================== #
# @Author: Fantasy_Silence                       #
# @Time: 2024-06-24                              #
# @IDE: Visual Studio Code & PyCharm             #
# @Python: 3.9.7                                 #
# ============================================== #
# @Descript: 这里存储了关于珍珠炮的一些技术参数     #
# ============================================== #

# ------ 平射角度下，相关技术参数 ------ #
MOTION_FOR_FLAT_FIRE = {
    # 每个TNT赋予珍珠的XZ轴动量
    "XZ_MOTION": 0.6025678975452011,

    # 每个TNT赋予珍珠的Y轴动量
    "Y_MOTION": -0.0011162018688096187,

    # 珍珠发射时拥有的初始Y轴动量
    "Y_INIT_MOTION": 0.2716278719434352,

    # 珍珠发射时的高度
    "Y_INIT_POSITION": 178.34722638929412,
}

# ------ 抛射角度下，相关技术参数 ------ #
MOTION_FOR_EJECTIONS = {
    # 每个TNT赋予珍珠的XZ轴动量
    "XZ_MOTION": 0.6026063622295216,

    # 每个TNT赋予珍珠的Y轴动量
    "Y_MOTION": 0.000639233791587035,

    # 珍珠发射时拥有的初始Y轴动量
    "Y_INIT_MOTION": 0.6909788463066233,

    # 珍珠发射时的高度
    "Y_INIT_POSITION": 178.41212248815643,
}
